lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programación Final PIC.c
//Función para enviar datos como "Error", "OK" y Nombre del robot
void EnviarDatos(char p){
    
    switch(p){
        case 'e':
            EnviarCadena("AT+CIPSEND=0,5\r\n",16);
            Enviando = 1;
            while(Enviando == 1){
            }
            EnviarCadena("Error",5);
            break;
        case 'n':
            EnviarCadena("AT+CIPSEND=0,7\r\n",16);
            Enviando = 1;
            while(Enviando == 1){
            }
            EnviarCadena(NombreRobot,7);
            break;
        default:
            EnviarCadena("AT+CIPSEND=0,4\r\n",16);
            Enviando = 1;
            while(Enviando == 1){
            }
            EnviarCadena("OK\r\n",4);
            break;
    }
    
}

// Interrupción para detectar cambio de estado en A0, A1, B0 y B1 para encoders.
void __ISR (34, IPL7SOFT) IntCN(void)
{
    if(CNSTATAbits.CNSTATA0 && PORTAbits.RA0){   //Se activa en el rising del pin 2 - Enc 1A
        
        if(SentidoActualDer == 'f'){
            PasosDerF++;
        }else{
            PasosDerB++;
        }
        
        DifTiempos = TiempoActual - TiempoPasadoDer;
        
        TiempoPasadoDer = TiempoActual;
        
        if(DifTiempos < 65000){
            TiemposPasosDer[contTiemposDer++] = DifTiempos;
        }else{
            TiemposPasosDer[contTiemposDer++] = 65000;
        }
        
        if(contTiemposDer == 6){
            contTiemposDer = 0;
        }
        
    }
    if(CNSTATAbits.CNSTATA1 && PORTAbits.RA1){   //Se activa en el rising del pin 3 - Enc 1B
        
        if(PORTAbits.RA0){
            SentidoActualDer = 'b';              //Llanta derecha gira hacia atrás
        }else{
            SentidoActualDer = 'f';              //Llanta derecha gira hacia adelante
        }
        
    }
    if(CNSTATBbits.CNSTATB0 && PORTBbits.RB0){   //Se activa en el rising del pin 4 - Enc 2B
        
        if(PORTBbits.RB1){
            SentidoActualIzq = 'f';              //Llanta derecha gira hacia atrás
        }else{
            SentidoActualIzq = 'b';              //Llanta derecha gira hacia adelante
        }

    }
    if(CNSTATBbits.CNSTATB1 && PORTBbits.RB1){   //Se activa en el rising del pin 5 - Enc 2A
        
        if(SentidoActualIzq == 'f'){
            PasosIzqF++;
        }else{
            PasosIzqB++;
        }
        
        DifTiempos = TiempoActual - TiempoPasadoIzq;
        
        TiempoPasadoIzq = TiempoActual;
        
        if(DifTiempos < 65000){
            TiemposPasosIzq[contTiemposIzq++] = DifTiempos;
        }else{
            TiemposPasosIzq[contTiemposIzq++] = 65000;
        }
        
        if(contTiemposIzq == 6){
            contTiemposIzq = 0;
        }
    }
    
    
    if(CNSTATAbits.CNSTATA2){
        if(PORTAbits.RA2){                              //Se activa en el rising del pin 9 - MaxSonar 1
            ContarSonico1 = 0;
        }else{                                          //Se activa en el falling del pin 9 - MaxSonar 1
            TiempoSonico1 = ContarSonico1;
        }
    }
    
    if(CNSTATAbits.CNSTATA3){
        if(PORTAbits.RA3){                              //Se activa en el rising del pin 10 - MaxSonar 2
            ContarSonico2 = 0;
        }else{                                          //Se activa en el falling del pin 10 - MaxSonar 2
            TiempoSonico2 = ContarSonico2;
        }
    }
    
	IFS1bits.CNAIF = 0b0;                   // Resetear bandera de interrupción
    IFS1bits.CNBIF = 0b0;                   // Resetear bandera de interrupción
}

// Interrupción del Timer 4 se activa cada 50ms
void __ISR (16, IPL7SOFT) IntTimer4(void)
{
    
    Mandar = 1;
	IFS0bits.T4IF = 0;                  // Resetear bandera de interrupción
}

// Interrupción del Timer 5 se activa cada 25us
void __ISR (20, IPL7SOFT) IntTimer5(void)
{    
    ContarSonico1++;
    ContarSonico2++;
    
	IFS0bits.T5IF = 0;                  // Resetear bandera de interrupción
}

//Función que activa la detección de objetos alrededor del robot y manda la info vía wifi
void Radar(void){
    
    EnviarCadena("AT+CIPSEND=0,1168\r\n",19);   //Indica al ESP-8266 que se enviarán 1168 bytes vía wifi
    Enviando = 1;
    while(Enviando == 1){                       //Espera hasta que se envía la info al ESP-8266
    }
    
    OC2RS = 4000;                       // Coloca el servomotor en su pocisión inicial
    
    __builtin_disable_interrupts();     // Se desactivan interrupciones
    
    IEC0bits.T4IE = 0b1;                // Timer 4 Interrupt Enabled
    IEC0bits.T5IE = 0b1;                // Timer 5 Interrupt Enabled
    
    IEC1bits.CNAIE = 0b0;               // Change Control PortA Interrupt Disabled
    CNENAbits.CNIEA2 = 0b1;             // Change Control pin A2 Interrupt Enabled
    CNENAbits.CNIEA3 = 0b1;             // Change Control pin A3 Interrupt Enabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    
    __builtin_enable_interrupts();      // Se activan interrupciones
    
    Grados = 0;
    
    blink = 0;
    
    while(Grados < 146){                //Realiza 146 lecturas en cada ultrasónico
        if(Mandar == 1){                //Si ya se realizó una lectura, ingresa a este condicional
            Mandar = 0;                 
            
            dmil = TiempoSonico1;       //Se carga y "codifica" la lectura del ultrasónico 1
            mil = dmil/1000;            // mil guarda en miles la cantidad de 25uS que se detectaron en la señal PWM recibida.
            dmil -= mil*1000;
            cen = dmil/100;             // cen guarda en centenas la cantidad de 25uS que se detectaron en la señal PWM recibida.
            dmil -= cen*100;
            dec = dmil/10;              // dec guarda en decenas la cantidad de 25uS que se detectaron en la señal PWM recibida.
            dmil -= dec*10;
            uni = dmil;                 // uni guarda en unidades la cantidad de 25uS que se detectaron en la señal PWM recibida.
            
