lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programación Final PIC.c
            dmil = TiempoSonico2;       //Se carga la lectura del ultrasónico 2
            
            //Envía al ESP-8266 los 4 dígitos calculados en ASCII de la lectura del ultrasónico 1
            U1TXREG = mil+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            mil = dmil/1000;
            dmil -= mil*1000;
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            //Envía al ESP-8266 los 4 dígitos calculados en ASCII de la lectura del ultrasónico 2
            U1TXREG = mil+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            Grados++;       //Variable que almacena el grado o ángulo en el que se está realizando la lectura
        }
        
        switch(blink){              //Condicional para el blink de los LED's durante la detección de objetos
            case 1:
                LATACLR = LED1;
                LATBCLR = LED2;
                LATBCLR = LED3;
                break;
            case 500:
                LATASET = LED1;
                break;
            case 1000:
                LATACLR = LED1;
                break;
            case 1500:
                LATBSET = LED2;
                break;
            case 2000:
                LATBCLR = LED2;
                break;
            case 2500:
                LATBSET = LED3;
                break;
            case 3000:
                blink = 0;
                break;
            default:
                break;
        }
    }         
    
    blink = 0;
    
    TiempoSonico1 = 0;
    TiempoSonico2 = 0;
    
    OC2RS = 4000;                       //Al finalizar regresa el servomotor a su posición inicial
    
    __builtin_disable_interrupts();     // Desactiva las interrupciones
    
    IEC0bits.T4IE = 0b0;                // Timer 4 Interrupt Disabled
    IEC0bits.T5IE = 0b0;                // Timer 5 Interrupt Disabled
    
    IEC1bits.CNAIE = 0b0;               // Change Control PortA Interrupt Disabled
    CNENAbits.CNIEA2 = 0b0;             // Change Control pin A2 Interrupt Disabled
    CNENAbits.CNIEA3 = 0b0;             // Change Control pin A3 Interrupt Disabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    
    __builtin_enable_interrupts();      // Habilita las interrupciones
    
}

// Interrupción del Timer 1 se activa cada 0.1ms
void __ISR (4, IPL7SOFT) IntTimer1(void)
{
    
    if(InitESP == 1){
        blink++;
    }
    
    if(Grados < 146){
        g++;
        if(g == 10){
            g = 0;
            OC2RS++;  
        }
    }
    
    TiempoActual++;
    
	IFS0bits.T1IF = 0;                  // Resetear bandera de interrupción
}

// Interrupción del UART Transmisión y Recepción
void __ISR (32, IPL7SOFT) IntUart1(void)
{
    charIn = U1RXREG;
    
    if(Enviando == 1 && charIn == '>'){
        Enviando = 0;
    }
    
    if(InitESP == 0){
        if(charIn != '\n' && charIn != '\r'){
            smsR[contR++] = charIn;
        }else if(charIn == '\n'){
            Revision = 1;
            contR = 0;
        }        
    }else if (Revision == 1){
        if(charIn != '\n' && charIn != '\r' && contR < 10){
            smsR[contR++] = charIn;
        }else if(charIn == '\n'){
            Revision = 2;
        }
    }else if(charIn == ':'){
        Revision = 1;
        contR = 0;
    }

    IFS1bits.U1RXIF = 0b0;
}

//ENVIAR CARACTER POR SERIAL
void EnviarCaracter(char c) {
    __builtin_disable_interrupts();
    U1TXREG = c;
    while (!U1STAbits.TRMT);                //espera a que termine la transimision
    __builtin_enable_interrupts();
}

//ENVIAR STRING POR SERIAL
void EnviarCadena(char p[], int a){
    for(k = 0; k < a; k++){
        EnviarCaracter(p[k]); 
    }
}

//Modifica el sentido en el que giran las llantas
void SentidoLlantas(void){
    
    switch(smsR[1]){
        case '1':            // Llantas hacia adelante
            LATBCLR = BDOS;
            LATBSET = BUNO;
            LATBCLR = AUNO;
            LATBSET = ADOS;
            break;
        case '2':            // Llanta derecha hacia adelante, izquierda hacia atrás
            LATBSET = BDOS;
            LATBCLR = BUNO;
            LATBCLR = AUNO;
            LATBSET = ADOS;
            break;
        case '3':            // Llanta derecha hacia atrás, izquierda hacia adelante
            LATBCLR = BDOS;
            LATBSET = BUNO;
            LATBSET = AUNO;
            LATBCLR = ADOS;
            break;
        case '4':            // Llantas hacia atrás
            LATBSET = BDOS;
            LATBCLR = BUNO;
            LATBSET = AUNO;
            LATBCLR = ADOS;
            break;
        default:
            break;
    }    
}

// Modifica la velocidad de la llanta derecha o izquierda
void Velocidad(void){
     
    var = (smsR[2]-48)*1000 + (smsR[3]-48)*100 + (smsR[4]-48)*10 + smsR[5] - 48;
    
    if(var > 4999){
        var = 4999;
    }else if(var < 0){
        var = 0;
    }
    
