lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programación Final PIC.c
    switch(smsR[1]){
        case 'd':
            OC1RS = var;
            break;
        case 'i':
            OC3RS = var;
            break;
        default:
            break;
    }    
}

//Envía los pasos recorridos por las llantas
void EnviarPasos(void){
    
    EnviarCadena("AT+CIPSEND=0,20\r\n",17);
    Enviando = 1;
    while(Enviando == 1){
    }
    
    dmil = PasosDerF/10000;
    PasosDerF -= dmil*10000;
    mil = PasosDerF/1000;
    PasosDerF -= mil*1000;
    cen = PasosDerF/100;
    PasosDerF -= cen*100;
    dec = PasosDerF/10;
    PasosDerF -= dec*10;
    uni = PasosDerF;
    PasosDerF -= uni;
    
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosIzqF/10000;
    PasosIzqF -= dmil*10000;
    mil = PasosIzqF/1000;
    PasosIzqF -= mil*1000;
    cen = PasosIzqF/100;
    PasosIzqF -= cen*100;
    dec = PasosIzqF/10;
    PasosIzqF -= dec*10;
    uni = PasosIzqF;
    PasosIzqF -= uni;
    
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosDerB/10000;
    PasosDerB -= dmil*10000;
    mil = PasosDerB/1000;
    PasosDerB -= mil*1000;
    cen = PasosDerB/100;
    PasosDerB -= cen*100;
    dec = PasosDerB/10;
    PasosDerB -= dec*10;
    uni = PasosDerB;
    PasosDerB -= uni;
    
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosIzqB/10000;
    PasosIzqB -= dmil*10000;
    mil = PasosIzqB/1000;
    PasosIzqB -= mil*1000;
    cen = PasosIzqB/100;
    PasosIzqB -= cen*100;
    dec = PasosIzqB/10;
    PasosIzqB -= dec*10;
    uni = PasosIzqB;
    PasosIzqB -= uni;
    
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);    
}

//Envía en qué sentido están girando las llantas
void EnviarSentidos(void){
    
    EnviarCadena("AT+CIPSEND=0,2\r\n",16);
    Enviando = 1;
    while(Enviando == 1){
    }
   
    EnviarCaracter(SentidoActualDer);
    EnviarCaracter(SentidoActualIzq);
}

void EnviarTiempos(void){
    
    EnviarCadena("AT+CIPSEND=0,10\r\n",17);
    Enviando = 1;
    while(Enviando == 1){
    }
    
    PromTiempos = 0;
    
    for(j = 0; j <6; j++){
        PromTiempos += TiemposPasosDer[j];
    }
    
    PromTiempos /= 6;
    
    dmil = PromTiempos/10000;
    PromTiempos -= dmil*10000;
    mil = PromTiempos/1000;
    PromTiempos -= mil*1000;
    cen = PromTiempos/100;
    PromTiempos -= cen*100;
    dec = PromTiempos/10;
    PromTiempos -= dec*10;
    uni = PromTiempos;
    PromTiempos -= uni;
    
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    for(j = 0; j <6; j++){
        PromTiempos += TiemposPasosIzq[j];
    }
    
    PromTiempos /= 6;
    
    dmil = PromTiempos/10000;
    PromTiempos -= dmil*10000;
    mil = PromTiempos/1000;
    PromTiempos -= mil*1000;
    cen = PromTiempos/100;
    PromTiempos -= cen*100;
    dec = PromTiempos/10;
    PromTiempos -= dec*10;
    uni = PromTiempos;
    PromTiempos -= uni;
    
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);    
}

// Configuración para Inicializar WIFI ESP
void InicializarESP(void){
    
    LATASET = LED1;
    LATBSET = LED2;
    LATBSET = LED3; 
    EnviarCadena("AT+RST\r\n",8);                               //Resetea Módulo Wifi
    PasosESP = 1;
    contR = 0;
    InitESP = 0;
    
    while(InitESP == 0){
        if(Revision == 1){
            switch(PasosESP){            
                case 1:
                    if(smsR[0]=='r' && smsR[1]=='e' && smsR[2]=='a' && smsR[3]=='d' && smsR[4]=='y'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("ATE0\r\n",6);                 //Desactivar echo de serial
                        PasosESP++;
                    }
                    break;

                case 2:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CWMODE_CUR=1\r\n",17);     //Modo cliente en comunicación WIFI
                        PasosESP++;
                    }
                    break;

                case 3:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CWJAP_CUR=\"",14);         //Conectarse a la red
                        EnviarCadena(Usuario,LargoUs);
                        EnviarCadena("\",\"",3);
                        EnviarCadena(Contrasena,LargoCn);
                        EnviarCadena("\"\r\n",3);
                        PasosESP++;
                    }
                    break;

                case 4:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CIPMUX=1\r\n",13);            //Multiple Conection
                        PasosESP++;
                    }
                    break;
                case 5:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CIPSERVER=1,",15);            //Iniciar server en el puerto designado
                        EnviarCadena(Puerto, LargoPt);
                        EnviarCadena("\r\n",2);
                        PasosESP++;
                    }
                    break;
                case 6:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        InitESP = 1;
                        PasosESP = 0;
                        Rutina = 1;
                    }
                default:
                    break;
            }
        }
    }
}